{
  "backend/main.mo": "Empty Motoko actor placeholder with no logic implemented.",
  "feature_evidence.json": "Metadata file listing implemented features, affected frontend files, and confidence levels for two feature updates.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files describing their roles in routing, UI, features, and utilities.",
  "frontend/.env.example": "Example environment variables for Razorpay and caricature API configuration with fallback behavior.",
  "frontend/index.css": "Tailwind global styles defining OKLCH-based light/dark theme variables and base styling.",
  "frontend/index.html": "Base HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/README.md": "Project documentation explaining features, tech stack, and structure of the React + Vite frontend.",
  "frontend/src/App.tsx": "Root application component handling global providers, screen navigation, and route guards.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper centering content with a max width for screens.",
  "frontend/src/components/PhotoInput.tsx": "Component enabling image upload or camera capture, managing preview, retake, and removal flows.",
  "frontend/src/components/TopBar.tsx": "Top navigation bar with branding, language selector, theme toggle, and optional logout button.",
  "frontend/src/config/env.ts": "Environment loader reading Vite env vars and exposing helpers for checking Razorpay and API config.",
  "frontend/src/features/auth/useLocalAuth.tsx": "Local authentication context managing users, sessions, login/signup, and logout using storage.",
  "frontend/src/features/generation/generationState.ts": "Type definitions for caricature generation input and result including photo data and timestamp.",
  "frontend/src/features/generation/useCaricatureGeneration.ts": "Handles caricature generation via API or placeholder, manages state, and stores results in localStorage.",
  "frontend/src/features/i18n/i18n.ts": "Defines supported languages and translation dictionaries for UI text.",
  "frontend/src/features/i18n/useI18n.tsx": "Provides an i18n context with language persistence and a translation helper.",
  "frontend/src/features/payment/razorpayPlaceholder.ts": "Placeholder Razorpay initializer that logs warnings when not configured.",
  "frontend/src/features/payment/useMockPayment.ts": "Simulates payment processing with a delay and marks payment as complete in localStorage.",
  "frontend/src/features/pricing/useRegionalPrice.ts": "Fetches user region to determine price info and caches it locally.",
  "frontend/src/features/theme/useTheme.tsx": "Theme context managing light/dark mode with persistence and DOM updates.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous actor, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth flow, exposing identity, login, logout, and status via context.",
  "frontend/src/index.css": "Tailwind base/theme styles defining light and dark mode color variables and transitions.",
  "frontend/src/lib/downloadPng.ts": "Downloads images, converting SVGs to PNG using a canvas when needed.",
  "frontend/src/lib/storage.ts": "Utility functions for safe JSON localStorage get, set, and remove operations.",
  "frontend/src/lib/uiStyles.ts": "Exports reusable Tailwind class strings for common UI components.",
  "frontend/src/main.tsx": "Bootstraps the React app by mounting App within providers for React Query and Internet Identity.",
  "frontend/src/screens/AuthScreen.tsx": "Provides login and signup forms with local auth, Google link, and tabbed UI, showing toasts and navigating on success.",
  "frontend/src/screens/InputPaymentScreen.tsx": "Handles photo upload, mock payment flow, and triggering caricature generation, including loading states and stored input recovery.",
  "frontend/src/screens/LandingScreen.tsx": "Displays the landing hero, example images, tagline, and a CTA button that navigates to the next screen.",
  "frontend/src/screens/ResultScreen.tsx": "Shows the generated caricature, optional source photo, download functionality, and an option to start a new attempt.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radii, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores the project’s current specification, architecture notes, issues, and implemented features for the CaricatureMe MVP."
}