{
  "backend/main.mo": "Defines response and error types for an actor canister, including base64 image data and status codes.",
  "feature_evidence.json": "Lists implemented UI features, their associated frontend files, components, and test IDs for tracking.",
  "frontend-file-summaries.txt": "Aggregates high-level summaries of major frontend files, describing their roles and behaviors in the app.",
  "frontend/.env": "Sets local environment variables for the caricature API URL and API key.",
  "frontend/.env.example": "Provides example environment variable configuration for Razorpay and the caricature API.",
  "frontend/index.css": "Defines Tailwind base layers and color variables for light and dark themes using OKLCH values.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads the main TypeScript bundle.",
  "frontend/README.md": "Introductory documentation describing app features, tech stack, and project structure.",
  "frontend/src/App.tsx": "Main app controller managing global providers, screen navigation, and authentication-based route guards.",
  "frontend/src/components/AppLayout.tsx": "Simple centered layout wrapper enforcing a max-width container.",
  "frontend/src/components/ArtStyleSelect.tsx": "Select component rendering four art style options with required values and labels.",
  "frontend/src/components/ErrorNotification.tsx": "Stub component for payment errors that renders nothing.",
  "frontend/src/components/PhotoInput.tsx": "Manages image selection, camera capture, previewing, and emitting selected photo data to parent components.",
  "frontend/src/components/SuccessNotification.tsx": "Displays a styled success message indicating payment completion.",
  "frontend/src/components/TopBar.tsx": "Top bar UI with theme toggle, language selector, and logout button using auth and i18n hooks.",
  "frontend/src/config/env.ts": "Loads environment variables for Razorpay and caricature API with fallbacks and helper checks.",
  "frontend/src/features/auth/useLocalAuth.tsx": "Local auth context handling signup, login, logout, and session persistence using localStorage and sessionStorage.",
  "frontend/src/features/generation/generationState.ts": "Defines types for caricature generation input and result.",
  "frontend/src/features/generation/useCaricatureGeneration.ts": "Hook that uploads an image and style to the caricature API, handles responses, and stores results locally.",
  "frontend/src/features/i18n/i18n.ts": "Contains supported languages and translation dictionaries for UI text.",
  "frontend/src/features/i18n/useI18n.tsx": "i18n context providing current language, setter, and translation lookup with localStorage persistence.",
  "frontend/src/features/payment/razorpayPlaceholder.ts": "Placeholder Razorpay initializer that logs warnings unless configured.",
  "frontend/src/features/payment/useMockPayment.ts": "Mock payment hook that simulates a successful payment and marks it in localStorage.",
  "frontend/src/features/pricing/useRegionalPrice.ts": "Fetches user region to select a localized price and caches it in localStorage.",
  "frontend/src/features/theme/useTheme.tsx": "Theme context managing light/dark mode with localStorage sync and DOM class toggling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, loading stored identities, and exposing login state helpers.",
  "frontend/src/index.css": "Defines Tailwind base layers and CSS variables for light and dark theme styling.",
  "frontend/src/lib/downloadPng.ts": "Utilities to download images or SVGs as PNG by rendering them to a canvas and triggering a file download.",
  "frontend/src/lib/storage.ts": "Wrapper functions for safely getting, setting, and removing JSON data in localStorage.",
  "frontend/src/lib/uiStyles.ts": "Exports standardized Tailwind class strings for cards, buttons, inputs, and labels.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider.",
  "frontend/src/screens/AuthScreen.tsx": "Renders login and signup UI with local auth logic, validation, and toast notifications.",
  "frontend/src/screens/InputPaymentScreen.tsx": "Handles photo upload, style selection, mock payment, and triggering caricature generation with stored input support.",
  "frontend/src/screens/LandingScreen.tsx": "Displays the landing page with sample images, branding, and a start button.",
  "frontend/src/screens/ResultScreen.tsx": "Displays the generated caricature, allows downloading the PNG, toggling the source photo, and starting a new generation.",
  "frontend/src/screens/UploadPhotoScreen.tsx": "Handles photo upload and style selection, triggers caricature generation, and shows status and download options based on results.",
  "frontend/src/screens/UploadScreen.tsx": "Intro screen explaining upload instructions and providing a button to continue to the photo upload flow.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for the frontend styling system.",
  "project_state.json": "Describes the project’s current state, requirements, features, issues, and architecture for the caricature-generation frontend."
}