{
  "backend/main.mo": "Empty Motoko actor placeholder with no logic implemented.",
  "feature_evidence.json": "Contains feature evidence metadata linking landing screen changes to specific features and test IDs.",
  "frontend-file-summaries.txt": "Provides high-level summaries of all frontend files including screens, hooks, utilities, and styles.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark mode color tokens and global styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component handling theme/i18n/auth providers and screen navigation with route guards.",
  "frontend/src/components/AppLayout.tsx": "Wrapper layout that centers content and constrains width to 500px.",
  "frontend/src/components/TopBar.tsx": "Top navigation bar with branding, language selector, theme toggle, and logout when authenticated.",
  "frontend/src/features/auth/useLocalAuth.tsx": "LocalStorage/session-based authentication provider handling login, signup, session restore, and logout.",
  "frontend/src/features/generation/generationState.ts": "Type definitions for caricature generation input and result structures.",
  "frontend/src/features/generation/useCaricatureGeneration.ts": "Hook simulating caricature generation, storing results, and managing generation state and errors.",
  "frontend/src/features/i18n/i18n.ts": "Translation dictionary mapping keys to strings across ten languages.",
  "frontend/src/features/i18n/useI18n.tsx": "Provides a React context for language selection and translation, persisting the chosen language in localStorage.",
  "frontend/src/features/payment/razorpayPlaceholder.ts": "Contains a mock Razorpay initializer that warns and returns a placeholder if no key is configured.",
  "frontend/src/features/payment/useMockPayment.ts": "Implements a fake payment hook that simulates processing and stores a paid flag in localStorage.",
  "frontend/src/features/pricing/useRegionalPrice.ts": "Determines regional pricing via IP lookup or cache and returns formatted price info.",
  "frontend/src/features/theme/useTheme.tsx": "Provides a theme context with light/dark mode toggling stored in localStorage and applied to the DOM.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login state, identity loading, and AuthClient configuration in a React context.",
  "frontend/src/index.css": "Defines Tailwind-based global styles including light/dark theme variables and smooth UI transitions.",
  "frontend/src/lib/downloadPng.ts": "Downloads images as PNG, converting SVG sources to PNG via canvas when needed.",
  "frontend/src/lib/storage.ts": "Provides safe JSON-based localStorage helpers for get, set, and remove operations.",
  "frontend/src/lib/uiStyles.ts": "Exports reusable Tailwind style strings for cards, buttons, inputs, and labels.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers before rendering the main App.",
  "frontend/src/screens/AuthScreen.tsx": "Implements a login/signup UI with local auth, translations, and styled form components including Google redirect.",
  "frontend/src/screens/InputPaymentScreen.tsx": "Form screen collecting user details and art style, then showing a mock payment step and triggering caricature generation on success.",
  "frontend/src/screens/LandingScreen.tsx": "Landing page showing app branding, example images, hero image, and a Get Started button.",
  "frontend/src/screens/ResultScreen.tsx": "Displays the generated caricature with user metadata and offers PNG downloading or starting a new attempt.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, radius, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing the CaricatureMe MVP architecture, features, requirements, and known issues."
}