{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update Google button to open Gmail and ensure frontend source is export-ready",
  "requirements": [
    {
      "id": "REQ-28",
      "summary": "Change the AuthScreen \"Continue with Google\" button to open Gmail (https://mail.google.com) in a new tab while keeping existing i18n text and security rel attributes.",
      "acceptanceCriteria": [
        "On AuthScreen, the anchor used by the \"Continue with Google\" button no longer points to https://accounts.google.com/signup.",
        "Clicking the button opens https://mail.google.com in a new browser tab (target=\"_blank\") with rel=\"noopener noreferrer\" preserved.",
        "The button text remains \"Continue with Google\" (use existing i18n key continue_with_google; do not add or change translations)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/AuthScreen.tsx",
          "operation": "modify",
          "description": "Update the \"Continue with Google\" anchor href to https://mail.google.com while preserving target=\"_blank\", rel=\"noopener noreferrer\", and the existing i18n key usage (continue_with_google)."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Ensure the frontend portion of the project is included and buildable in the delivered full-project source export, reflecting the Gmail-link change.",
      "acceptanceCriteria": [
        "The delivered output includes the complete frontend and backend directories (including configuration files like frontend/.env.example) needed to run/build the app.",
        "No files are omitted that are required to install dependencies and start the app using the project’s existing tooling.",
        "The included source matches the implemented change where the Google button opens https://mail.google.com."
      ],
      "file_operations": [
        {
          "path": "frontend/README.md",
          "operation": "create",
          "description": "Add concise frontend run/build instructions and a note that the AuthScreen \"Continue with Google\" button opens https://mail.google.com, to support delivering a complete, buildable project source bundle."
        }
      ]
    }
  ]
}